import Footer from "@/components/Footer/Footer";
import Navigation from "@/components/Navigation/Navigation";
import { Transition } from "@headlessui/react";
import React, { Fragment, useState } from "react";

const Instruction = () => {
  const [activeIndex, setActiveIndex] = useState(null);

  const questions = [
    {
      title: "როგორ დავრეგისტრირდე საიტზე?",
      answer:
        "საიტზე რეგისტრაციისთვის გთხოვთ გადახვიდეთ რეგისტრაციის ბმულზე და შეავსოთ მოცემული ველები. ამის შემდეგ თქვენ მეილზე მიიღებთ დადასტურების ლინკს, დააკლიკეთ მას და თქვენი ანგარიში გააქტიურდება.",
    },
    {
      title: "როგორ შევიძინო ელ.წიგნი?",
      answer:
        "ელ. წიგნის შეძენა შესაძლებელია ნებისმიერი ბანკის ბარათით. თუკი გსურს შეძენა, ჩარიცხავ შესაბამის თანხას ერთ-ერთ ანგარიშის ნომერზე (რომელსაც ნახავთ იქვე), შემდეგ მოცემულ ველში შეიყვანთ ბარათის მფლობელის სახელსა და გვარს და მხოლოდ ამის შემდეგ დააჭერ ვარდისფერ ღილაკს „გადავიხადე“. დაელოდები რამდენიმე საათი (მაქს. 24) და წიგნი გაგიაქტიურდება. ",
    },
    {
      title: "შეძენილ ელ.წიგნს სახლში მომიტანთ?",
      answer:
        "ჩვენთან იყიდება მხოლოდ ელექტრონული წიგნები, ჩვენ არ ვყიდით ნაბეჭდ წიგნებს. ელექტრონული წიგნების წაკითხვა მხოლოდ ელექტრონულ მოწყობილობებშია შესაძლებელი.",
    },
    {
      title: "როგორ შემიძლია უფასო ელ.წიგნი განვათავსო ჩემს ელ.ბიბლიოთეკაში?",
      answer:
        "შედით ,,უფასო რესურსების“ გრაფაში და ნახავთ ყველა რესურსს ერთად.",
    },
    {
      title: "სად შემიძლია ნაყიდი ელ.წიგნების ნახვა?",
      answer: "შეძენილი ელ.წიგნების ნახვა შეგიძლიათ ,,ჩემს ბიბლიოთეკაში“",
    },
    {
      title: "შემიძლია თუ არა ანგარიშის გაუქმება?",
      answer: "ანგარიშის გაუქმება, სამწუხაროდ, არ არის შესაძლებელი. ",
    },
    {
      title: "შემიძლია თუ არა გადახდილი თანხის უკან დაბრუნება?",
      answer:
        "გადახდილი თანხის უკან დაბრუნება არ შეგიძლიათ. წარმატებით დასრულებული ტრანზაქცია ვერ გაუქმდება.",
    },
    {
      title: "როგორ შევცვალო პაროლი?",
      answer:
        "პაროლის შესაცვლელად გადადით შემდეგ ბმულზე  ან შედით თქვენს პირად გვერდზე , მარცხენა მხარეს ჩამონათვალში დააჭირეთ 'პაროლის შეცვლა' -ს, შემდეგ გამოჩნდება შესავსები ველები, ჩაწერეთ ძველი პაროლი, შემდეგ გაიმეორეთ ახალი პაროლი და დაადასტურეთ ღილაკით 'შეცვლა'",
    },
    {
      title: "საქართველოში არ ვცხოვრობ, შემიძლია თუ არა შევიძინო ელ.წიგნი?",
      answer:
        "დიახ, ელ.წიგნის შეძენა შესაძლებელია მსოფლიოს ნებისმიერი კუთხიდან, თანხის გადახდა კი შეგიძლიათ ნებისმიერი ბანკის ბარათით.",
    },
    {
      title: "არის თუ არა ფასდაკლებები ელ.წიგნებზე?",
      answer:
        "ზოგადად ელექტორნული წიგნების ფასი ბეჭდურ წიგნებთან შედარებით საგრძნობლად იაფია. დამატებითი ინფორმაციის მისაღებად შეგიძლიათ ესტუმროთ ჩვენს facebook გვერდს, სადაც ყველანაირ ახალ ინფორმაციას ვაქვეყნებთ ხოლმე.",
    },
    {
      title: "არის თუ არა საიტზე უფასო რესურსები?",
      answer:
        "დიახ, ჩვენს საიტზე განთავსებული უფასო რესურსების ჩამონათვალი შეგიძლიათ იხილოთ შემდეგ ბმულზე.",
    },
  ];

  const toggleQuestion = (index: any) => {
    if (activeIndex === index) {
      setActiveIndex(null);
    } else {
      setActiveIndex(index);
    }
  };

  return (
    <Fragment>
      <Navigation />
      <section className="relative py-20 overflow-hidden bg-gradient-to-r to-tl from-[#c7d8e8] to-[#fde6e7]">
        {/* <img className="absolute top-0 left-0 mt-44" src="saturn-assets/images/faq/light-blue-left.png" alt=""> */}
        {/* <img className="absolute top-0 right-0 mt-10" src="saturn-assets/images/faq/star-right.svg" alt=""> */}
        <div className="relative container px-4 mx-auto">
          <div className="max-w-5xl mx-auto">
            <div className="text-center mb-10 md:mb-24">
              <span className="inline-block py-1 px-3 mb-4 text-xs font-semibold text-orange-900 bg-gradient-to-r to-tl from-[#c7d8e8] to-[#fde6e7] rounded-full">
                ხშირად დასმული კითხვები
              </span>
              <h1 className="font-heading mt-5 text-3xl xs:text-3xl md:text-4xl font-bold text-gray-400">
                <span className="font-serif ">ხშირად დასმული კითხვები</span>
              </h1>
            </div>
            <div className="p-10 bg-blue-400 rounded-4xl shadow-lg ">
              {questions.map((question, index) => {
                return (
                  <button
                    onClick={() => toggleQuestion(index)}
                    key={index}
                    className=" mt-10 flex group w-full items-start justify-between text-left">
                    <div>
                      <h3
                        className={` flex justify-between align-center text-sm md:text-xl font-semibold hover:text-white transition-all  ${
                          activeIndex === index ? "text-white" : "text-white"
                        }`}>
                        {question.title}
                        <div className="pt-1">
                          {activeIndex === index ? (
                            <span>
                              <svg
                                width="17"
                                height="3"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                  d="M15.4619 0.045166H1.46194C1.19673 0.045166 0.942374 0.150523 0.754838 0.338059C0.567302 0.525596 0.461945 0.77995 0.461945 1.04517C0.461945 1.31038 0.567302 1.56474 0.754838 1.75227C0.942374 1.93981 1.19673 2.04517 1.46194 2.04517H15.4619C15.7272 2.04517 15.9815 1.93981 16.1691 1.75227C16.3566 1.56474 16.4619 1.31038 16.4619 1.04517C16.4619 0.77995 16.3566 0.525596 16.1691 0.338059C15.9815 0.150523 15.7272 0.045166 15.4619 0.045166Z"
                                  fill="white"></path>
                              </svg>
                            </span>
                          ) : (
                            <span>
                              <svg
                                width="17"
                                height="16"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                  d="M15.4619 7H9.46194V1C9.46194 0.734784 9.35659 0.48043 9.16905 0.292893C8.98151 0.105357 8.72716 0 8.46194 0C8.19673 0 7.94237 0.105357 7.75484 0.292893C7.5673 0.48043 7.46194 0.734784 7.46194 1V7H1.46194C1.19673 7 0.942374 7.10536 0.754838 7.29289C0.567302 7.48043 0.461945 7.73478 0.461945 8C0.461945 8.26522 0.567302 8.51957 0.754838 8.70711C0.942374 8.89464 1.19673 9 1.46194 9H7.46194V15C7.46194 15.2652 7.5673 15.5196 7.75484 15.7071C7.94237 15.8946 8.19673 16 8.46194 16C8.72716 16 8.98151 15.8946 9.16905 15.7071C9.35659 15.5196 9.46194 15.2652 9.46194 15V9H15.4619C15.7272 9 15.9815 8.89464 16.1691 8.70711C16.3566 8.51957 16.4619 8.26522 16.4619 8C16.4619 7.73478 16.3566 7.48043 16.1691 7.29289C15.9815 7.10536 15.7272 7 15.4619 7Z"
                                  fill="white"></path>
                              </svg>
                            </span>
                          )}
                        </div>
                      </h3>
                      <div
                        className={`${
                          activeIndex === index
                            ? "max-h-screen transition-max-height duration-400 ease-out p-10"
                            : "max-h-0 transition-max-height duration-300 ease-in"
                        } mt-3  text-sm md:text-lg  bg-white duration-300   text-black overflow-hidden`}>
                        <span
                          className={`${
                            activeIndex === index ? "opacity-100" : "opacity-0"
                          } transition-all`}>
                          {question.answer}
                        </span>
                      </div>
                    </div>
                  </button>
                );
              })}
            </div>
          </div>
        </div>
        <div className="mt-[100px] max-w-6xl px-10 mx-auto">
          <h1 className="font-heading text-3xl text-center  xs:text-6xl md:text-3xl font-bold text-gray-500">
            <span className="font-serif ">
              საავტორო უფლებების შესახებ ინფორმაცია
            </span>
          </h1>
          <p className="font-heading text-lg xs:text-lg md:text-lg  text-gray-500 mt-5 text-left">
            გთხოვთ, გაითვალისწინოთ, ჩვენი პოლიტიკა გულისხმობს ნებისმიერი სახის
            არაკეთილსინდისიერ ქცევაზე (კანონდარღვევებზე) შესაბამის რეაგირებას.
            რაც გულისხმობს, რომ ჩვენ დაუყოვნებლივ, განმეორებითი გაფრთხილების
            გარეშე გავაუქმებთ ისეთი მომხმარებლის წვდომას ჩვენს პლატფორმასთან,
            რომელიც ჩვენ მიერ განმეორებით იქნება შემჩნეული კანონის დარღვევაში.
            განმეორებითი კანონდამრღვევი ისეთი მომხმარებელია, რომელიც ჩვენ მიერ
            ერთხელ უკვე იქნება გაფრთხილებული საავტორო უფლებების დარღვევის
            შესახებ.
          </p>
          <p className="mt-5 font-heading text-3xl xs:text-3xl md:text-2xl font-bold text-gray-400 text-left">
             პლატფორმის გამოყენების  შემთხვევაში თქვენ თანხმდებით, რომ არ:
          </p>
          <p className="font-heading text-lg xs:text-lg md:text-lg  text-gray-500 mt-5 text-left">
            • წაშლით, მწყობრიდან გამოიყვანთ, დააზიანებთ ან რაიმე სხვა ხერხით
            შეაფერხებთ პლატფორმის უსაფრთხოების მექანიზმების გამართულ მუშაობას,
            რისი საშუალებითაც იზღუდება და შეუძლებელი ხდება ჩვენს პლატფორმაზე
            ხელმისაწვდომი ტექსტური ან სხვა ციფრული მასალის  სხვა მიზნით  (გარდა
            პირადი მოხმარებისა: წაკითხვა, მოსმენა ციფრულ ფორმატში) გამოყენებას,
            კოპირებას, ამობეჭდვასა და სხვა რაიმე გზით გაზიარების/გავრცელების
            შესაძლებლობას.
            <br />• გაყიდით, შეცვლით, საჯაროდ წარმოადგენთ ან
            გადასცემთ/გააგზავნით, გამოაქვეყნებთ, დაარედაქტირებთ, ადაპტირებას
            გაუკეთებთ, ან რაიმე სხვა ხერხით, უფლების გარეშე გამოიყენებთ ჩვენს
            პლატორმაზე არსებულ ტექსტურ თუ სხვა სახის ციფრულ მასალას,
            გარდა ჩვენგან სპეციალურად მიღებული უფლების შემთხვევისა.
            <br />• ეცდებით, შეაღწიოთ, გაშიფროთ ან რაიმე სხვა გზით აღმოაჩინოთ
            ჩვენი პლატფორმის, მისი ნებისმიერი ნაწილის საწყისი კოდი.
          </p>
          <p className=" text-gray-700 text-[18px] font-bold mt-5">
            გთხოვთ, გაითვალისწინოთ რომ მომხმარებელს არ შეუძლია ჩამოტვირთოს,
            დაბეჭდოს, დააკოპიროს და გაავრცელოს შეძენილი ელ.წიგნი. საიტზე
            განთავსებული ლიტერატურა დაცულია და წიგნის კოპირების საშუალებები
            შეზღუდულია. ასევე, შეუძლებელია ერთი და იგივე მომხმარებლის სახელითა
            და პაროლით ერთდროულად რამდენიმე მოწყობილობიდან კითხვა. იმ
            შემთხვევაში, თუ მომხმარებელი საკუთარ ანგარიშზე ინფორმაციას გადასცემს
            სხვა მომხმარებელს, ადმინისტრაცია უფლებას იტოვებს გააუქმოს ეს
            ანგარიში.
          </p>

          <h1 className="font-heading text-3xl text-center  xs:text-6xl md:text-3xl mt-10 font-bold text-gray-500">
            <span className="font-serif ">სერვისის გამოყენების პირობები</span>
          </h1>
          <p className="mt-5 font-heading text-3xl xs:text-3xl md:text-2xl font-bold text-gray-400 text-left">
            სერვისის გამოყენების ნებისმიერ შემთხვევაში თქვენ ადასტურებთ, რომ:
          </p>
          <p className="font-heading text-lg xs:text-lg md:text-lg  text-gray-500 mt-5 text-left">
            ა.სრულად - გაეცანით წინამდებარე შეთანხმების პირობებს სერვისის გამოყენების დაწყებამდე.
          </p>
          <p className="font-heading text-lg xs:text-lg md:text-lg  text-gray-500 mt-5 text-left">
            ბ.ეთანხმებით შეთანხმების ყველა პირობას და აღიარებთ მათი დაცვის ვალდებულებას ან წინააღმდეგ შემთხვევაში{" "}
            <br />
             დაუყოვნებლივ წყვეტთ სერვისით სარგებლობას.
          </p>
          <p className="font-heading text-lg xs:text-lg md:text-lg  text-gray-500 mt-5 text-left">
            •1.1. - სერვისის ზოგიერთი ნაწილის ფუნქციონალური შესაძლებლობების გამოყენება შესაძლებელია მხოლოდ
            <br />
             მომხმარებლის მიერ რეგისტრაციის გავლის შემდეგ.
            •1.2. - მომხმარებლის მიერ არჩეული ლოგინი და პაროლი აუცილებელი და საკმარისი პირობაა 1.1. პუნქტში
            <br />
             ხსენებული სერვისის შესაძლებლობების გამოყენებისათვის.
            •1.3- ადმინისტრაცია უფლებას იტოვებს - არ მისცეს მომხმარებელს გარკვეული ლოგინების გამოყენების უფლება,
            <br />
             ასევე დააწესოს შეზღუდვები ლოგინისა და პაროლის სიმბოლოების რაოდენობაზე და ა.შ.
            •1.4- მომხმარებელი თვითონაა პასუხისმგებელი თავისი ლოგინისა და პაროლის უსაფრთხოებაზე
            <br />
             (ადვილად ამოცნობადობაზე). ასევე დამოუკიდებლად უზრუნველყოფს მათ კონფიდენციალურობას.
            •1.5. - ადმინისტრაცია გარანტიას იძლევა, რომ მესამე პირებს არ გადაცემს მომხმარებლის
            <br />
             პირად ინფორმაციას (ელ. ფოსტა, პაროლი).
            <br />
            •1.6. - მომხმარებელს უფლება არა აქვს დააკოპიროს, გაიმეოროს, გაყიდოს,
            <br />
            მესამე პირს გადასცეს თავის ექაუნთის
            მონაცემები ან რაიმე სხვა კომერციული მიზნით გამოიყენოს ფასიანი კონტენტი, რომელიც
            <br />
             სერვისის საშუალებითაა ხელმისაწვდომი, 
            <br />
            გარდა იმ შემთხვევებისა, როცა ამის უფლება მომხმარებელმა ადმინისტრაციისგან მიიღო. 
            <br />
            ამ პუნქტის დარღვევის შემთხვევაში ადმინისტრაციას უფლება აქვს
            მომხმარებელს საიტთან წვდომა დაუბლოკოს.
            •1.7. - მომხმარებელი იყენებს სერვისს თავისი საკუთარი რისკით, ისეთს „როგორიც არის“.
            <br />
             ადმინისტრაცია არ იღებს თავის თავზე არავითარ 
            <br />
            პასუხისმგებლობას სერვისის მომხმარებლის ინტერესებთან შესაბამისობაზე.
            •1.8. - ადმინისტრაცია არ იძლევა გარანტიას, რომ სერვისი სრულ შეესაბამეისობაში იქნება 
            <br />
            მომხმარებლის მოთხოვნებთან,
            <br />
             ყოველთვის უწყვეტად,
            <br />
             სწრაფად და საიმედოდ მიეწოდება მას. აგრეთვე სერვისით მიღებული ინფორმაცია იქნება 
            <br />
            ყოველთვის უშეცდომო.
            •1.9. - ადმინისტრაცია პასუხს არ აგებს მომხმარებლის მიერ სერვისის გამოყენების 
            <br />
            შედეგად მიღებულ არანაირ (მატერიალურ თუ მორალურ) ზარალზე.
            •1.10. - ფასიანი სერვისის შეძენის შემთხვევაში - მომხმარებლის მოთხოვნა თანხის 
            <br />
            უკან დაბრუნების თაობაზე არ დაკმაყოფილდება.
            •1.11. - წინამდებარე შეთანხმება წარმოადგენს ხელშეკრულებას მომხმარებელსა 
            <br />
            და ადმინისტრაციას შორის სერვისის გამოყენების შესახებ და
            <br />
             ჩაანაცვლებს მომხმარებელსა და ადმინისტრაციას შორის ყველა ადრინდელ შეთანხმებას.
          </p>
        </div>
      </section>
      <Footer />
    </Fragment>
  );
};

export default Instruction;
